{  
   "length":9,
   "generator":[  
      {  
         "title":"(*) panzanella",
         "intro":"This recipe is all about sharing flavours. The bread soaks up the herby roasting juices of (*) to give you the crunchiest, most delicious croutons ever.",
         "image":"https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46257803.jpg?tr=w-400",
         "serves":8,
         "cooksIn":100,
         "ingredients":[  
            "1.5kg whole free-range (*)",
            "olive oil",
            "bunch of fresh mixed herbs, such as sage, rosemary and thyme",
            "270g ciabatta loaf",
            "1 bulb ofgarlic",
            "2kg mixed ripe tomatoes",
            "1 bunch of fresh basil",
            "1 small red onion",
            "red wine vinegar",
            "100g whole black olives",
            "2 tablespoons baby capers",
            "Parmesan cheese"
         ],
         "method":[  
            "Preheat the oven to 180ºC/350ºC/gas 4.",
            "Rub (*) all over with sea salt, black pepper and oil, and stuff with the herbs, reserving some rosemary for later.",
            "Tear up the ciabatta and scatter in a roasting tin. Crush and add the unpeeled garlic cloves, and place (*) on top.",
            "Roast for 1 hour 30 minutes, or until cooked through and the juices run clear when (*) is pierced with a skewer.",
            "Remove from the oven, cover and leave to rest.",
            "Roughly chop the tomatoes into different shapes and sizes. Keep half to one side and add the rest to a large bowl with half of the basil leaves. Keep the remaining leaves for later.",
            "Peel, finely slice and add the onion to the bowl along with a good splash of red wine vinegar. Scrunch the whole lot together with your hands. You want to end up with a colourful, tasty pulp. Taste and season, if necessary.",
            "Add 4 tablespoons of red wine vinegar with 2 tablespoons of olive oil and a pinch of black pepper, then give it all a good stir.",
            "Take the bread from the roasting tray and add most of it to the bowl (reserving a few pieces), and toss together really well.",
            "Destone and chop up the olives, and add to the bowl along with the capers and remaining tomatoes, bread and basil leaves.",
            "Mix gently to bring it all together and finish with a sprinkling of rosemary leaves and shavings of Parmesan.",
            "Carve (*) and serve with the panzanella."
         ]
      },
      {  
         "title":"Crusted (*) rack with rhubarb",
         "intro":"This almond and herb-coated (*) gives a twist to your Sunday roast.",
         "image":"https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/8nZC6iqSa_F8eDuZ8HEIeA.jpg?tr=w-400",
         "serves":6,
         "cooksIn":50,
         "ingredients":[  
            "750g rhubarb",
            "6 tablespoons runny honey",
            "olive oil",
            "75g whole or flaked almonds",
            "1 bunch of fresh mixed herbs , such as parsley, mint or chives",
            "1 handful of breadcrumbs",
            "2 racks of (*)",
            "2 tablespoons Dijon mustard"
         ],
         "method":[  
            "Preheat the oven to 200ºC/gas 6.",
            "Slice the rhubarb into 5cm pieces and place in a roasting tray. Drizzle over the honey and a good lug of oil, mix well, then spread out evenly over the pan.",
            "Blitz the almonds in a food processor with the herb leaves, then transfer to a bowl. Stir in the breadcrumbs and season.",
            "Using a sharp knife, score the fat on (*), rub in the mustard, then pat on the breadcrumb mix.",
            "Place (*) on the rhubarb, drizzle with oil and cook for 22 to 35 minutes for medium, or a further 5 to 10 minutes for well done.",
            "Rest for 5 to 10 minutes, then carve into cutlets and serve with the rhubarb."
         ]
      },
      {  
         "title":"Spring (*) & citrus stew",
         "intro":"This is a brilliant transitional dish. You’ve got the stew element, which is warming, comforting and exactly what you want during the colder months, but there are loads of fresh colours and flavours to remind you what’s around the corner at this time of year. The lemon and egg sauce you stir through at the end is something I first saw added to Greek stews. I know it might sound a bit unusual, but the results will make you sit up and smile.",
         "image":"https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/3TiRvISsawYAwqa4Xy7PMd.jpg?tr=w-400",
         "serves":6,
         "cooksIn":95,
         "ingredients":[  
            "(*)",
            "olive oil",
            "6 cloves of garlic",
            "1 large onion",
            "1 bulb of fennel",
            "1 leek",
            "1 handful of asparagus spears",
            "1 handful of fresh peas",
            "1 handful of broad beans",
            "Half a bunch of fresh flat-leaf parsley",
            "Half a bunch of fresh dill",
            "A few sprigs of fresh tarragon",
            "600ml organic (*) stock",
            "1 large handful of green olives",
            "1 handful of tinned cannellini beans",
            "2 lemons",
            "2 large free-range eggs",
            "2 tablespoonsnatural yoghurt",
            "extra virgin olive oil"
         ],
         "method":[  
            "Joint (*) into legs, thighs, breasts and arms.",
            "Put a large casserole pan over a medium heat and add 3 tablespoons of olive oil. Season (*) portions and place in the pan. Cook for 10 minutes, until browned on all sides, turning regularly, then remove to a plate.",
            "Meanwhile, prep your veg. Peel and finely chop the garlic and onion. Trim and finely chop the fennel, trim and finely slice the leek and snap the woody ends off the asparagus. Pod the peas and broad beans, then pick the herb leaves and finely chop the stalks.",
            "There should be a few tablespoons of fat left in the pan; if you have more, get rid of most of it. Add the garlic, onion, leek, fennel and herb stalks and cook until softened, stirring occasionally.",
            "Place (*) back in the pan, pour in the stock and season with black pepper. Cover with a lid, then cook over medium-low for around 45 minutes, or until the flesh is tender and falling off the bone.",
            "Bring the mixture back up to a boil, destone and stir in the olives, peas, broad beans and cannellini beans. When the vegetables are done, add most of the herb leaves, reserving some for garnish.",
            "Remove (*) from the stew and use 2 forks to pull the flesh off the bones. Discard the bones, return the meat to the pan, then season to perfection and remove from the heat.",
            "At this point, the stew will be delicious, but it’s the next step that makes it amazing. Beat the juice of 2 lemons and the eggs together well, then pour slowly into the stew – don’t let it boil or the egg mixture with scramble – it should just add a gorgeous shine.",
            "Stir in the yoghurt before ladling the stew into bowls. Drizzle a little extra virgin olive oil over each bowl, grate over a little Parmesan and serve sprinkled with the reserved herbs."
         ]
      },
      {  
         "title":"One-pan fabulous (*)",
         "intro":"",
         "image":"https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/55846373.jpg?tr=w-400",
         "serves":4,
         "cooksIn":15,
         "ingredients":[  
            "300g white basmati rice",
            "6 heaped teaspoons green olive tapenade",
            "350g ripe mixed-colour cherry tomatoes",
            "Half a bunch of fresh basil",
            "500g (*) fillets"
         ],
         "method":[  
            "In a large shallow casserole pan on a high heat, mix the rice with 2 heaped teaspoons of tapenade, then pour over 600ml of water. Put the lid on and let it come to the boil while you halve the tomatoes and, in a bowl, mix them with 1 tablespoon each of olive oil and red wine vinegar. Taste, season to perfection with sea salt and black pepper, and tear in most of the basil leaves. <br> Cut the fish into four equal-sized pieces and place in the pan, pushing them into the rice. Scatter over the dressed tomatoes. Put the lid back on and boil for 10 minutes, or until the rice is cooked through, then remove the lid and cook for a further 2 minutes until all the liquid has evaporated. Spoon the remaining tapenade over the fish, pick over the remaining basil leaves, drizzle lightly with extra virgin olive oil, and dish up."
         ]
      },
      {  
         "title":"Leek & (*) parcels",
         "intro":"These are simple and elegant – and easy on the washing-up. You could always prep these parcels the evening before, then simply pop them in the oven as soon as you get in the door.",
         "image":"https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/58393575.jpg?tr=w-400",
         "serves":4,
         "cooksIn":40,
         "ingredients":[  
            "50g unsalted butter",
            "2 medium leeks",
            "4 (*) fillets, skin off, boned",
            "8 tablespoons dry vermouth , or dry white wine",
            "4 tablespoonsorganic chicken stock",
            "1 tablespoon baby capers",
            "A few sprigs of fresh dill"
         ],
         "method":[  
            "Preheat the oven to 200ºC/400ºF/gas 6.",
            "Melt the butter in a non-stick frying pan over a medium heat. Cut out four 40cm squares of greaseproof paper and brush with a little melted butter. Trim the leeks, then julienne or cut into matchsticks and sauté in the butter for 6 to 8 minutes, or until lightly golden. Season well.",
            "Divide half of the leeks between the paper. Place a (*) fillet on each, season, and spoon over 2 tablespoons of vermouth, 1 tablespoon of stock and the remaining leeks. Scatter over the capers. Finely chop and scatter over the dill. Fold up the sides of the paper and scrunch up to make secure parcels.",
            "Place the parcels on a baking sheet and cook for 15 minutes, or until (*) is cooked. Open the parcels at the table."
         ]
      },
      {  
         "title":"(*) katsu curry",
         "intro":"Katsu curry is super-delicious and is one of Japan’s most popular dishes. Its heart is Indian spices, which were brought through the spice trade to Britain, where we manufactured our first curry powder; then, back again through trade, they went to Japan, along with the French technique of thickening sauces with a roux (fat and flour) – and the katsu curry was born. Katsu was traditionally made with pork, but I have to say, chicken is my favourite. ",
         "image":"https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/70063671.jpg?tr=w-400",
         "serves":4,
         "cooksIn":90,
         "ingredients":[  
            "4 x 150g free-range skinless boneless (*) breasts",
            "250 ml buttermilk",
            "2 heaped teaspoons medium curry powder",
            "2 cloves of garlic",
            "120 g panko breadcrumbs",
            "1 mug of basmati rice , (320g)",
            "25 g creamed coconut",
            "2 litres vegetable oil",
            "1 onion",
            "2 cloves of garlic",
            "1 thumb-sized piece of ginger",
            "1 medium carrot",
            "1 bunch of fresh coriander , (30g)",
            "olive oil",
            "1 teaspoon each garam masala , medium curry powder, turmeric",
            "2 heaped tablespoons plain flour",
            "1 heaped teaspoon mango chutney",
            "1 red onion",
            "1 lemon",
            "1 fresh red chilli"
         ],
         "method":[  
            "Press down firmly with the palm of your hand to slightly flatten each (*) breast. Place them in a bowl, pour over the buttermilk, add the curry powder and a pinch of sea salt, crush in the garlic, then toss to coat. Cover and marinate in the fridge for at least 2 hours, but preferably overnight.",
            "When the time’s up, sprinkle the breadcrumbs on to a tray. Remove the (*) from the buttermilk, shake off the excess, then turn in the breadcrumbs, pressing down to make them stick and flatten them a little more. Keep in the fridge until you’re ready to cook.",
            "For the sauce, peel the onion, garlic, ginger and carrot, then finely chop with the coriander stalks (reserving the leaves).",
            "Fry in a large pan on a medium low heat with 1 tablespoon of olive oil and the spices for 15 minutes, or until starting to caramelize, stirring regularly.",
            "Stir in the flour, then the mango chutney. Pour in 800ml of boiling water and leave to blip away for 15 minutes, or until reduced to a nice sauce consistency, stirring occasionally. Taste, season and add more mango chutney, if needed.",
            "Meanwhile, place 1 mug of rice in a medium pan with 2 mugs of boiling water and a good pinch of salt. Break in the creamed coconut and mix together. Bring to the boil, stir, then put the lid on and simmer for 10 minutes, or until the water has evaporated. Turn the heat off and leave with the lid on.",
            "Make a quick pickle by peeling and very finely slicing the red onion. Place in a bowl, finely grate in the lemon zest, squeeze in the juice and add a good pinch of salt. Deseed and finely slice the chilli and add to the bowl, then mix up.",
            "Just under half fill a large sturdy pan with vegetable oil – the oil should be 8cm deep, but never fill your pan more than half full – and place on a medium-high heat. Use a thermometer to tell when it’s ready (170°C), or add a piece of potato and wait until it turns golden – that’s the sign that it’s ready to go.",
            "Carefully lower (*) into the oil, fry for 8 minutes, or until golden and cooked through, then drain on kitchen paper.",
            "Alternatively, drizzle 2 tablespoons of olive oil into a large, cold non-stick frying pan on a medium heat. Cook (*) for 10 minutes, or until golden and cooked through, turning after 6 minutes and drizzling with an extra 2 tablespoons of oil as you turn.",
            "To serve, put a quarter of the rice into a small bowl, press to compact and turn out on to a plate, then repeat with the other portions. Place (*) next to the rice, cover with the sauce, then sprinkle over the pickle and the coriander leaves."
         ]
      },
      {  
         "title":"(*) & sweet potato traybake",
         "intro":"Bursting with fresh Asian flavours, this easy (*) traybake can be on the table in well under an hour.",
         "image":"https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/52PsxSQ6adABT58ca-ar0X.jpg?tr=w-400",
         "serves":4,
         "cooksIn":50,
         "ingredients":[  
            "1 large sweet potato",
            "2 sticks of lemongrass",
            "2.5 cm piece of ginger",
            "2 cloves of garlic",
            "1 teaspoon sesame oil",
            "150 ml organic vegetable stock",
            "150 ml light coconut milk",
            "6-8 lime leaves or 1 lime",
            "1 long red chilli",
            "4 x 150 g (*) fillets"
         ],
         "method":[  
            "Preheat the oven to 190°C/375°F/gas 5.",
            "Scrub the sweet potato, then slice into thin rounds. Arrange the slices, overlapping, in a large roasting tin.",
            "Bruise the lemongrass, then finely chop the tender parts. Peel and finely chop the ginger and garlic. Finely slice the chilli.",
            "Mix the sesame oil, stock, coconut milk and two-thirds each of the lemongrass, ginger and garlic. Pour over the potatoes, tuck in the lime leaves (or squeeze the juice on top and scatter over the zest) and sprinkle over the chilli.",
            "Roast for 20 to 25 minutes, or until the potatoes are done. About 8 to 10 minutes before the cooking time is up, sit (*) on the potatoes and top with the rest of the lemongrass, ginger and garlic.",
            "When (*) is just cooked, drizzle with soy sauce, if you like. Delicious served with green beans and mangetout."
         ]
      },
      {  
         "title":"(*) in a pot",
         "intro":"",
         "image":"https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46263860.jpg?tr=w-400",
         "serves":4,
         "cooksIn":95,
         "ingredients":[  
            "500 g ripe tomatoes",
            "2 cloves of garlic",
            "1 onion",
            "200 g olives",
            "½ a bunch of fresh flat-leaf parsley",
            "1 x 400 g tin chickpeas",
            "4 free-range (*) legs",
            "olive oil",
            "1.5 litres organic (*) stock",
            "1 fresh bay leaf",
            "200 g baby potatoes"
         ],
         "method":[  
            "Halve any large tomatoes, then peel and finely slice the garlic. Peel and chop the onion, stone the olives, and pick and roughly chop the parsley. Drain the chickpeas.",
            "In a large pan, brown (*) in a little oil. Drain off any excess fat, then add the tomatoes, stock and garlic.",
            "Simmer for 45 minutes, then add all the other ingredients. Cook on a low heat for a further 30 minutes",
            "Before serving, shred the (*) from the bone and add it back to the pan, discarding the bones and skin, then season to taste.",
            "Delicious served with garlic mayo and a chunk of crusty bread."
         ]
      },
      {  
         "title":"(*) milanese with spaghetti",
         "intro":"",
         "image":"https://img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46262582.jpg?tr=w-400",
         "serves":2,
         "cooksIn":45,
         "ingredients":[  
            "2 cloves of garlic",
            "½ a bunch of fresh basil",
            "olive oil",
            "1 x 400 g tin of plum tomatoes",
            "2 x 150 g skinless free-range (*) breasts",
            "100 g plain flour",
            "2 large free-range eggs",
            "100 g breadcrumbs",
            "30 g Parmesan cheese",
            "150 g dried spaghetti"
         ],
         "method":[  
            "Peel and finely slice the garlic. Pick the basil leaves, then finely chop the stalks.",
            "Heat a splash of oil in a medium saucepan over a medium heat. Add the garlic and basil stalks and cook for 2 minutes, or until golden.",
            "Tip the tinned tomatoes into the pan and squash them down with the back of a spoon. Fill the empty tomato tin with water and pour this in too. Season and simmer for 30 minutes, or until reduced, glossy and thick.",
            "Place the (*) breasts on a board and cover with a double layer of clingfilm. Bash with a saucepan to flatten them to 5mm thick.",
            "Tip the flour into one bowl, then crack and beat the eggs in a second bowl. Add the breadcrumbs to a third, finely grate in half of the Parmesan, then shake to combine.",
            "Coat (*) in the flour, then the egg and finally in the cheesy breadcrumbs, until thoroughly coated.",
            "Heat a lug of oil in a large frying pan over a medium heat and cook (*) for 3 to 4 mins on each side, or until golden and the meat is cooked through.",
            "Cook the spaghetti according to the packet instructions, then drain and add to the tomato sauce, loosening with a little of the cooking water if needed.",
            "Serve the pasta alongside the crispy (*), with the remaining Parmesan and basil leaves scattered over."
         ]
      }
   ]
}